ptudor/navlistener-software/esp32/sdkconfig.defaults
# navfeeder-esp default sdkconfig. Committed; the generated `sdkconfig` is gitignored.
# Shared settings for the supported ESP32-S3 observer. CMake also loads
# sdkconfig.defaults.s3 for the 16 MiB flash / 8 MiB PSRAM board profile.

CONFIG_IDF_TARGET="esp32s3"

# --- Flash + partitions ------------------------------------------------------
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions-s3.csv"
CONFIG_PARTITION_TABLE_OFFSET=0x10000

# --- Clock / FreeRTOS (default) ----------------------------------------
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_160=y
CONFIG_FREERTOS_HZ=1000

# --- Console (built-in USB-Serial-JTAG) ------------------------------------
CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=y

# --- TLS: mbedTLS floor pinned to 1.2 (GNF1) ------------
# The collector floor is TLS 1.2; we pin the ceiling to 1.2 as well to match the
# fleet and avoid TLS 1.3 post-handshake complexity on a constrained node.
CONFIG_MBEDTLS_SSL_PROTO_TLS1_2=y
# TLS 1.3 stays available in mbedTLS but the pusher requests 1.2 max at the esp-tls layer.
CONFIG_MBEDTLS_CERTIFICATE_BUNDLE=y
CONFIG_MBEDTLS_HARDWARE_AES=y
CONFIG_MBEDTLS_HARDWARE_SHA=y
# Commissioning evidence: the session proof signs keying material exported from the TLS
# session (RFC 5705), so a proof cannot be replayed on or relayed to another connection.
CONFIG_MBEDTLS_SSL_KEYING_MATERIAL_EXPORT=y

# --- NVS (config store) ------------------------------------------------------
CONFIG_NVS_ENCRYPTION=n

# --- Logging -----------------------------------------------------------------
CONFIG_LOG_DEFAULT_LEVEL_INFO=y

# --- Watchdog: rx_task subscribes and feeds it; a wedged reader reboots, not hangs.
# (pusher_task is not subscribed — its reconnect backoff sleep can exceed the 10s timeout.)
CONFIG_ESP_TASK_WDT_INIT=y
CONFIG_ESP_TASK_WDT_TIMEOUT_S=10
CONFIG_ESP_TASK_WDT_PANIC=y

# --- UART ISR in IRAM -------------------------------------------------
# Keep the UART ISR in IRAM so a cache-disabled window (flash erase/write during an
# NVS/PHY commit) can't stall it past the 128-byte HW FIFO (~2.8 ms at 460800) and
# silently drop receiver bytes. Cheap insurance for the byte-lossless-forwarding bar.
CONFIG_UART_ISR_IN_IRAM=y
